---
type: SATImportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# SATImportOptions

`Autodesk.Revit.DB.SATImportOptions` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SATImportOptions | — | `` |
| Constructor | SATImportOptions | 2014 | `public SATImportOptions ()` |